; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;; DOMAIN: Project_TER
;;
;; Description:
;; This domain models a logistics terminal (TER) where packages are processed
;; through several warehouse stages before shipment.
;;
;; The domain supports two types of package flows:
;;
;; 1. Standard Packages
;;    Unload -> Storage -> Preparation -> Control -> Loading
;;
;; 2. Mixed Packages
;;    Unload -> Split Mixed Palette -> Storage -> Preparation
;;    -> Control -> Loading
;;
;; Mixed palettes contain multiple product categories and must be split into
;; standard packages before continuing through the normal workflow.
;;
;; Workers are responsible for transporting packages between connected
;; warehouse locations.
;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain Project_TER)

    (:requirements :strips :typing :negative-preconditions)

    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ;; TYPES
    ;;
    ;; loc
    ;;     Warehouse locations and operational areas.
    ;;
    ;; worker
    ;;     Employee responsible for handling packages.
    ;;
    ;; package
    ;;     Generic package type.
    ;;
    ;; mono
    ;;     Single-product package.
    ;;
    ;; mixed
    ;;     Mixed palette containing multiple product categories.
    ;;     Must be split before storage.
    ;;
    ;; standard
    ;;     Standard package created after splitting a mixed palette.
    ;;
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

    (:types
        loc worker - object
        package - object
        mono mixed standard - package
    )

    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ;; PREDICATES
    ;;
    ;; (on ?package ?location)
    ;;     Package is located at a specific location.
    ;;
    ;; (at ?worker ?location)
    ;;     Worker is located at a specific location.
    ;;
    ;; (arrived ?package)
    ;;     Package has entered the warehouse workflow.
    ;;
    ;; (prepared ?package)
    ;;     Package has completed preparation.
    ;;
    ;; (controlled ?package)
    ;;     Package has passed inspection.
    ;;
    ;; (loaded ?package)
    ;;     Package has been loaded for shipment.
    ;;
    ;; (connected ?location1 ?location2)
    ;;     Direct path exists between two locations.
    ;;
    ;; (is_mixed ?package)
    ;;     Package is identified as a mixed palette.
    ;;
    ;; (is_split ?mixed_package)
    ;;     Mixed palette has already been separated.
    ;;
    ;; (processed ?mixed_package)
    ;;     Splitting process has been completed.
    ;;
    ;; Zone predicates define warehouse roles.
    ;;
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

    (:predicates

        ;; Package location
        (on ?y - package ?l - loc)

        ;; Worker location
        (at ?w - worker ?l - loc)

        ;; Package status
        (arrived ?y - package)
        (prepared ?y - package)
        (controlled ?y - package)
        (loaded ?y - package)

        ;; Navigation
        (connected ?l1 - loc ?l2 - loc)

        ;; Mixed package management
        (is_mixed ?y - package)
        (is_split ?y - mixed)
        (processed ?y - mixed)

        ;; Warehouse zones
        (is_arrival_zone ?l - loc)
        (is_storage_zone ?l - loc)
        (is_prep_zone ?l - loc)
        (is_control_zone ?l - loc)
        (is_shipping_dock ?l - loc)
    )

    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ;; ACTION: worker_travel
    ;;
    ;; Purpose:
    ;;     Move a worker between two connected locations.
    ;;
    ;; Preconditions:
    ;;     - Worker is at the source location.
    ;;     - Source and destination are connected.
    ;;
    ;; Effects:
    ;;     - Worker leaves source location.
    ;;     - Worker arrives at destination.
    ;;
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

    (:action worker_travel
        :parameters (?w - worker ?from - loc ?to - loc)

        :precondition
            (and
                (at ?w ?from)
                (connected ?from ?to)
            )

        :effect
            (and
                (not (at ?w ?from))
                (at ?w ?to)
            )
    )

    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ;; ACTION: unload
    ;;
    ;; Purpose:
    ;;     Receive a package into the warehouse.
    ;;
    ;; Preconditions:
    ;;     - Worker and package are together.
    ;;     - Package has not already arrived.
    ;;     - Destination is an arrival zone.
    ;;     - Locations are connected.
    ;;
    ;; Effects:
    ;;     - Package enters the warehouse system.
    ;;     - Package becomes marked as arrived.
    ;;     - Worker moves with the package.
    ;;
    ;; Workflow Stage:
    ;;     First stage of processing.
    ;;
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

    (:action unload
        :parameters (?w - worker ?y - package ?from - loc ?to - loc)

        :precondition
            (and
                (at ?w ?from)
                (on ?y ?from)
                (not (arrived ?y))
                (is_arrival_zone ?to)
                (connected ?from ?to)
            )

        :effect
            (and
                (not (on ?y ?from))
                (on ?y ?to)

                (not (at ?w ?from))
                (at ?w ?to)

                (arrived ?y)
            )
    )

    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ;; ACTION: split_mixed_palette
    ;;
    ;; Purpose:
    ;;     Split a mixed palette into standard palettes.
    ;;
    ;; Business Rule:
    ;;     Mixed palettes cannot enter storage directly.
    ;;     They must first be separated into standard packages.
    ;;
    ;; Preconditions:
    ;;     - Worker is present.
    ;;     - Mixed palette is in an arrival zone.
    ;;     - Mixed palette has arrived.
    ;;     - Mixed palette has not already been split.
    ;;
    ;; Effects:
    ;;     - Mixed palette is marked as split.
    ;;     - Mixed palette is marked as processed.
    ;;     - Original mixed palette disappears.
    ;;     - Two standard packages are created.
    ;;     - New packages inherit the arrived status.
    ;;
    ;; Workflow Stage:
    ;;     Optional stage for mixed palettes only.
    ;;
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

    (:action split_mixed_palette
        :parameters (?w - worker ?ymix - mixed ?y1 - standard ?y2 - standard ?l - loc)

        :precondition
            (and
                (at ?w ?l)
                (is_arrival_zone ?l)
                (on ?ymix ?l)
                (arrived ?ymix)
                (not (is_split ?ymix))
            )

        :effect
            (and
                (is_split ?ymix)
                (processed ?ymix)

                (not (on ?ymix ?l))

                (on ?y1 ?l)
                (arrived ?y1)

                (on ?y2 ?l)
                (arrived ?y2)
            )
    )

    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ;; ACTION: stockage
    ;;
    ;; Purpose:
    ;;     Move a package into storage.
    ;;
    ;; Business Rule:
    ;;     Mixed palettes cannot be stored directly.
    ;;     Only standard packages may enter storage.
    ;;
    ;; Preconditions:
    ;;     - Package has arrived.
    ;;     - Package is not mixed.
    ;;     - Package has not been prepared.
    ;;     - Destination is a storage zone.
    ;;
    ;; Effects:
    ;;     - Package is moved to storage.
    ;;     - Worker moves with the package.
    ;;
    ;; Workflow Stage:
    ;;     Storage stage.
    ;;
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

    (:action stockage
        :parameters (?w - worker ?y - package ?from - loc ?to - loc)

        :precondition
            (and
                (at ?w ?from)
                (on ?y ?from)

                (arrived ?y)
                (not (is_mixed ?y))
                (not (prepared ?y))

                (is_storage_zone ?to)
                (connected ?from ?to)
            )

        :effect
            (and
                (not (on ?y ?from))
                (on ?y ?to)

                (not (at ?w ?from))
                (at ?w ?to)
            )
    )

    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ;; ACTION: prepare_command
    ;;
    ;; Purpose:
    ;;     Prepare a package for shipment.
    ;;
    ;; Preconditions:
    ;;     - Worker and package are together.
    ;;     - Package has not already been controlled.
    ;;     - Destination is a preparation zone.
    ;;
    ;; Effects:
    ;;     - Package becomes prepared.
    ;;     - Package is moved to preparation area.
    ;;     - Worker moves with package.
    ;;
    ;; Workflow Stage:
    ;;     Preparation stage.
    ;;
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

    (:action prepare_command
        :parameters (?w - worker ?y - package ?from - loc ?to - loc)

        :precondition
            (and
                (at ?w ?from)
                (on ?y ?from)

                (not (controlled ?y))

                (is_prep_zone ?to)
                (connected ?from ?to)
            )

        :effect
            (and
                (not (on ?y ?from))
                (on ?y ?to)

                (not (at ?w ?from))
                (at ?w ?to)

                (prepared ?y)
            )
    )

    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ;; ACTION: control_check
    ;;
    ;; Purpose:
    ;;     Inspect and validate a prepared package.
    ;;
    ;; Preconditions:
    ;;     - Package is prepared.
    ;;     - Package has not already been loaded.
    ;;     - Destination is a control zone.
    ;;
    ;; Effects:
    ;;     - Package passes inspection.
    ;;     - Package becomes controlled.
    ;;     - Worker moves with package.
    ;;
    ;; Workflow Stage:
    ;;     Quality-control stage.
    ;;
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

    (:action control_check
        :parameters (?w - worker ?y - package ?from - loc ?to - loc)

        :precondition
            (and
                (at ?w ?from)
                (on ?y ?from)

                (prepared ?y)
                (not (loaded ?y))

                (is_control_zone ?to)
                (connected ?from ?to)
            )

        :effect
            (and
                (not (on ?y ?from))
                (on ?y ?to)

                (not (at ?w ?from))
                (at ?w ?to)

                (controlled ?y)
            )
    )

    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ;; ACTION: load_truck
    ;;
    ;; Purpose:
    ;;     Load a validated package onto an outgoing shipment location.
    ;;
    ;; Preconditions:
    ;;     - Package has passed control.
    ;;     - Destination is a shipping dock.
    ;;
    ;; Effects:
    ;;     - Package becomes loaded.
    ;;     - Package reaches final shipment stage.
    ;;     - Worker moves with package.
    ;;
    ;; Workflow Stage:
    ;;     Final stage of the process.
    ;;
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

    (:action load_truck
        :parameters (?w - worker ?y - package ?from - loc ?to - loc)

        :precondition
            (and
                (at ?w ?from)
                (on ?y ?from)

                (controlled ?y)

                (is_shipping_dock ?to)
                (connected ?from ?to)
            )

        :effect
            (and
                (not (on ?y ?from))
                (on ?y ?to)

                (not (at ?w ?from))
                (at ?w ?to)

                (loaded ?y)
            )
    )
)

; problem
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;; PROBLEM: multi_staff_warehouse
;;
;; Description:
;; This problem models a warehouse operation involving multiple workers
;; and different types of incoming cargo.
;;
;; Unlike previous scenarios, two workers are available and start at
;; different locations in the warehouse. This allows tasks to be shared
;; between employees and may reduce overall processing time.
;;
;; Incoming Cargo:
;;
;;   1. pal_mono
;;      - Mono-product palette.
;;      - Must complete the full workflow.
;;
;;   2. pal_mixed
;;      - Mixed palette.
;;      - Must be split into two standard palettes before processing.
;;
;;   3. pal_standard_direct
;;      - Standard palette already located in the arrival zone.
;;      - Already marked as arrived.
;;      - Does not require unloading.
;;
;; Standard Workflow:
;;
;;     Unload
;;         ↓
;;     Storage
;;         ↓
;;     Preparation
;;         ↓
;;     Control
;;         ↓
;;     Loading
;;
;; Mixed Palette Workflow:
;;
;;     Unload
;;         ↓
;;     Split Mixed Palette
;;         ↓
;;     Create v_pal1 and v_pal2
;;         ↓
;;     Storage
;;         ↓
;;     Preparation
;;         ↓
;;     Control
;;         ↓
;;     Loading
;;
;; Goal:
;;   - All cargo must be processed and loaded.
;;   - The mixed palette must be successfully split.
;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (problem multi_staff_warehouse)

    (:domain Project_TER)

    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ;; OBJECTS
    ;;
    ;; LOCATIONS
    ;;
    ;; truck_dock      : Incoming truck unloading area.
    ;; arrival_zone    : Receiving area where packages enter the workflow.
    ;; rack_storage    : Storage location.
    ;; prep_zone       : Preparation area.
    ;; control_zone    : Inspection and quality-control area.
    ;; shipping_dock   : Outgoing shipping area.
    ;;
    ;; WORKERS
    ;;
    ;; cariste1        : Worker starting at the incoming truck.
    ;; cariste2        : Worker starting near shipping operations.
    ;;
    ;; PACKAGES
    ;;
    ;; pal_mono            : Mono-product palette.
    ;; pal_mixed           : Mixed palette requiring splitting.
    ;; pal_standard_direct : Standard palette already at arrival zone.
    ;;
    ;; GENERATED PACKAGES
    ;;
    ;; v_pal1, v_pal2 : Standard palettes created after splitting
    ;;                  the mixed palette.
    ;;
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

    (:objects

        ;; Warehouse locations
        truck_dock
        arrival_zone
        rack_storage
        prep_zone
        control_zone
        shipping_dock - loc

        ;; Workers
        cariste1
        cariste2 - worker

        ;; Incoming mono palette
        pal_mono - mono

        ;; Incoming mixed palette
        pal_mixed - mixed

        ;; Standard palettes created after splitting
        v_pal1
        v_pal2 - standard

        ;; Standard palette already in the warehouse
        pal_standard_direct - standard
    )

    (:init

        ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
        ;; INITIAL WORKER POSITIONS
        ;;
        ;; Workers begin at different locations:
        ;;
        ;; cariste1 starts at the receiving side of the warehouse.
        ;; cariste2 starts at the shipping side of the warehouse.
        ;;
        ;; This setup allows work to be distributed between employees.
        ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

        (at cariste1 truck_dock)
        (at cariste2 shipping_dock)

        ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
        ;; WAREHOUSE CONNECTIVITY
        ;;
        ;; All locations are connected in both directions.
        ;;
        ;; Warehouse Layout:
        ;;
        ;; truck_dock
        ;;      |
        ;; arrival_zone
        ;;      |
        ;; rack_storage
        ;;      |
        ;; prep_zone
        ;;      |
        ;; control_zone
        ;;      |
        ;; shipping_dock
        ;;
        ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

        (connected truck_dock arrival_zone)
        (connected arrival_zone truck_dock)

        (connected arrival_zone rack_storage)
        (connected rack_storage arrival_zone)

        (connected rack_storage prep_zone)
        (connected prep_zone rack_storage)

        (connected prep_zone control_zone)
        (connected control_zone prep_zone)

        (connected control_zone shipping_dock)
        (connected shipping_dock control_zone)

        ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
        ;; ZONE DEFINITIONS
        ;;
        ;; Assigns warehouse functions to each location.
        ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

        (is_arrival_zone arrival_zone)

        (is_storage_zone rack_storage)

        (is_prep_zone prep_zone)

        (is_control_zone control_zone)

        (is_shipping_dock shipping_dock)

        ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
        ;; INITIAL PACKAGE POSITIONS
        ;;
        ;; pal_mono and pal_mixed are still in the truck and
        ;; must first be unloaded.
        ;;
        ;; pal_standard_direct is already located in the arrival
        ;; zone and can immediately continue through the workflow.
        ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

        (on pal_mono truck_dock)

        (on pal_mixed truck_dock)

        (on pal_standard_direct arrival_zone)

        ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
        ;; PACKAGE CLASSIFICATION
        ;;
        ;; pal_mixed is identified as a mixed palette.
        ;; It must be split before storage.
        ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

        (is_mixed pal_mixed)

        ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
        ;; INITIAL PROCESSING STATUS
        ;;
        ;; pal_standard_direct has already been unloaded and
        ;; registered in the warehouse system.
        ;;
        ;; Therefore it already possesses the arrived status.
        ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

        (arrived pal_standard_direct)
    )

    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ;; GOAL STATE
    ;;
    ;; Success Conditions:
    ;;
    ;; 1. pal_mono must be loaded.
    ;; 2. pal_standard_direct must be loaded.
    ;; 3. pal_mixed must have been processed (split).
    ;; 4. v_pal1 must be loaded.
    ;; 5. v_pal2 must be loaded.
    ;;
    ;; This ensures that all incoming cargo has completed the
    ;; warehouse workflow and is ready for shipment.
    ;;
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

    (:goal
        (and

            ;; Mono palette shipped
            (loaded pal_mono)

            ;; Standard palette shipped
            (loaded pal_standard_direct)

            ;; Mixed palette processed
            (processed pal_mixed)

            ;; Generated palettes shipped
            (loaded v_pal1)
            (loaded v_pal2)
        )
    )
)

; plan
1. (worker_travel cariste2 shipping_dock control_zone)
   deleted: (at cariste2 shipping_dock)
   added: (at cariste2 control_zone)
   goals met: 0 of 5
2. (unload cariste1 pal_mono truck_dock arrival_zone)
   deleted: (on pal_mono truck_dock) (at cariste1 truck_dock)
   added: (on pal_mono arrival_zone) (at cariste1 arrival_zone) (arrived pal_mono)
   goals met: 0 of 5
3. (worker_travel cariste2 control_zone prep_zone)
   deleted: (at cariste2 control_zone)
   added: (at cariste2 prep_zone)
   goals met: 0 of 5
4. (worker_travel cariste1 arrival_zone truck_dock)
   deleted: (at cariste1 arrival_zone)
   added: (at cariste1 truck_dock)
   goals met: 0 of 5
5. (worker_travel cariste2 prep_zone rack_storage)
   deleted: (at cariste2 prep_zone)
   added: (at cariste2 rack_storage)
   goals met: 0 of 5
6. (unload cariste1 pal_mixed truck_dock arrival_zone)
   deleted: (on pal_mixed truck_dock) (at cariste1 truck_dock)
   added: (on pal_mixed arrival_zone) (at cariste1 arrival_zone) (arrived pal_mixed)
   goals met: 0 of 5
7. (worker_travel cariste2 rack_storage arrival_zone)
   deleted: (at cariste2 rack_storage)
   added: (at cariste2 arrival_zone)
   goals met: 0 of 5
8. (split_mixed_palette cariste1 pal_mixed v_pal2 v_pal1 arrival_zone)
   deleted: (on pal_mixed arrival_zone)
   added: (is_split pal_mixed) (processed pal_mixed) (on v_pal2 arrival_zone) (arrived v_pal2) (on v_pal1 arrival_zone) (arrived v_pal1)
   goals met: 1 of 5
9. (stockage cariste2 pal_mono arrival_zone rack_storage)
   deleted: (on pal_mono arrival_zone) (at cariste2 arrival_zone)
   added: (on pal_mono rack_storage) (at cariste2 rack_storage)
   goals met: 1 of 5
10. (stockage cariste1 v_pal2 arrival_zone rack_storage)
   deleted: (on v_pal2 arrival_zone) (at cariste1 arrival_zone)
   added: (on v_pal2 rack_storage) (at cariste1 rack_storage)
   goals met: 1 of 5
11. (worker_travel cariste1 rack_storage arrival_zone)
   deleted: (at cariste1 rack_storage)
   added: (at cariste1 arrival_zone)
   goals met: 1 of 5
12. (prepare_command cariste2 v_pal2 rack_storage prep_zone)
   deleted: (on v_pal2 rack_storage) (at cariste2 rack_storage)
   added: (on v_pal2 prep_zone) (at cariste2 prep_zone) (prepared v_pal2)
   goals met: 1 of 5
13. (stockage cariste1 v_pal1 arrival_zone rack_storage)
   deleted: (on v_pal1 arrival_zone) (at cariste1 arrival_zone)
   added: (on v_pal1 rack_storage) (at cariste1 rack_storage)
   goals met: 1 of 5
14. (prepare_command cariste1 v_pal1 rack_storage prep_zone)
   deleted: (on v_pal1 rack_storage) (at cariste1 rack_storage)
   added: (on v_pal1 prep_zone) (at cariste1 prep_zone) (prepared v_pal1)
   goals met: 1 of 5
15. (control_check cariste1 v_pal2 prep_zone control_zone)
   deleted: (on v_pal2 prep_zone) (at cariste1 prep_zone)
   added: (on v_pal2 control_zone) (at cariste1 control_zone) (controlled v_pal2)
   goals met: 1 of 5
16. (load_truck cariste1 v_pal2 control_zone shipping_dock)
   deleted: (on v_pal2 control_zone) (at cariste1 control_zone)
   added: (on v_pal2 shipping_dock) (at cariste1 shipping_dock) (loaded v_pal2)
   goals met: 2 of 5
17. (worker_travel cariste1 shipping_dock control_zone)
   deleted: (at cariste1 shipping_dock)
   added: (at cariste1 control_zone)
   goals met: 2 of 5
18. (worker_travel cariste1 control_zone prep_zone)
   deleted: (at cariste1 control_zone)
   added: (at cariste1 prep_zone)
   goals met: 2 of 5
19. (control_check cariste1 v_pal1 prep_zone control_zone)
   deleted: (on v_pal1 prep_zone) (at cariste1 prep_zone)
   added: (on v_pal1 control_zone) (at cariste1 control_zone) (controlled v_pal1)
   goals met: 2 of 5
20. (worker_travel cariste1 control_zone prep_zone)
   deleted: (at cariste1 control_zone)
   added: (at cariste1 prep_zone)
   goals met: 2 of 5
21. (worker_travel cariste1 prep_zone rack_storage)
   deleted: (at cariste1 prep_zone)
   added: (at cariste1 rack_storage)
   goals met: 2 of 5
22. (prepare_command cariste1 pal_mono rack_storage prep_zone)
   deleted: (on pal_mono rack_storage) (at cariste1 rack_storage)
   added: (on pal_mono prep_zone) (at cariste1 prep_zone) (prepared pal_mono)
   goals met: 2 of 5
23. (control_check cariste2 pal_mono prep_zone control_zone)
   deleted: (on pal_mono prep_zone) (at cariste2 prep_zone)
   added: (on pal_mono control_zone) (at cariste2 control_zone) (controlled pal_mono)
   goals met: 2 of 5
24. (worker_travel cariste1 prep_zone rack_storage)
   deleted: (at cariste1 prep_zone)
   added: (at cariste1 rack_storage)
   goals met: 2 of 5
25. (load_truck cariste2 pal_mono control_zone shipping_dock)
   deleted: (on pal_mono control_zone) (at cariste2 control_zone)
   added: (on pal_mono shipping_dock) (at cariste2 shipping_dock) (loaded pal_mono)
   goals met: 3 of 5
26. (worker_travel cariste1 rack_storage arrival_zone)
   deleted: (at cariste1 rack_storage)
   added: (at cariste1 arrival_zone)
   goals met: 3 of 5
27. (stockage cariste1 pal_standard_direct arrival_zone rack_storage)
   deleted: (on pal_standard_direct arrival_zone) (at cariste1 arrival_zone)
   added: (on pal_standard_direct rack_storage) (at cariste1 rack_storage)
   goals met: 3 of 5
28. (prepare_command cariste1 pal_standard_direct rack_storage prep_zone)
   deleted: (on pal_standard_direct rack_storage) (at cariste1 rack_storage)
   added: (on pal_standard_direct prep_zone) (at cariste1 prep_zone) (prepared pal_standard_direct)
   goals met: 3 of 5
29. (control_check cariste1 pal_standard_direct prep_zone control_zone)
   deleted: (on pal_standard_direct prep_zone) (at cariste1 prep_zone)
   added: (on pal_standard_direct control_zone) (at cariste1 control_zone) (controlled pal_standard_direct)
   goals met: 3 of 5
30. (load_truck cariste1 pal_standard_direct control_zone shipping_dock)
   deleted: (on pal_standard_direct control_zone) (at cariste1 control_zone)
   added: (on pal_standard_direct shipping_dock) (at cariste1 shipping_dock) (loaded pal_standard_direct)
   goals met: 4 of 5
31. (worker_travel cariste1 shipping_dock control_zone)
   deleted: (at cariste1 shipping_dock)
   added: (at cariste1 control_zone)
   goals met: 4 of 5
32. (load_truck cariste1 v_pal1 control_zone shipping_dock)
   deleted: (on v_pal1 control_zone) (at cariste1 control_zone)
   added: (on v_pal1 shipping_dock) (at cariste1 shipping_dock) (loaded v_pal1)
   goals met: 5 of 5
